In [ ]:
import numpy as np
import pandas as pd

In [ ]:
titanic_df = pd.read_csv("https://raw.githubusercontent.com/Make-School-Courses/DS-1.1-Data-Analysis/master/Notebooks/Datasets/titanic.csv")
titanic_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]


### What if we want to calculate the quartiles of our ages? 

A *quartile* breaks our data up into four *quantiles*!

Numpy provides us with a method to calculate this!

In [ ]:
# calculate the quartiles of our "Age" column
df_age = titanic_df["Age"].dropna()

# parameters are: dataset, quantile (between 0 and 1 inclusive)
# we provide 0.25 to indicate we want to see what the first "quarter" milestone of our ages is!
np.quantile(df_age, 0.25)

20.125

### Your turn! 

Find the age where 1/8th of the ages are above it, and 7/8ths are below it using Numpy!

In [ ]:
# Write your code here

### What about fare? 

We've all seen the movie The Titanic, and might feel a little like how much passengers paid had an affect on their chances of survival. So, since we're all thinking it, let's explore how much everyone paid a bit more.

Do you think that you can find the lowest decile of our Fare? 
*Remember, a decile breaks our data up into 10 equal parts*

In [ ]:
# Write your code here

### What about the upper 9th decile of our fare?

In [ ]:
# Write your code here

### Let's get a little more tricky!

1. Given the upper 9th decile ($ amount) of our fare, can you find out how many passengers paid that amount or higher?

2. Then, can we find out **how many passengers paid a fare equal to or higher than the median fare within our upper 9th decile?**

In [ ]:
# This one's trickier, let's break the problem down:
# First, we can use the upper 9th decile (or, our 90th percentile fares) entry that we found above 
# TODO: store a new DF with all fares > than our 9th decile amount 


# Then, let's count how many passengers paid a fare that amount or higher
# TODO: find # of passengers within that new DF 


# For the second part, we'll need to break this up one more time.
# TODO: Find the median value of our 9th decile DF

# TODO: count # of passengers that paid a fare > than that median value